posts/html_button_issue.html
<!DOCTYPE html><html><head><!-- 2025-07-27 --><meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>HTML Button's Weird Behavior</title>
<meta name="generator" content="Org Mode" />
<link href="https://fonts.cdnfonts.com/css/share-tech-mono" rel="stylesheet"><link rel="stylesheet" type="text/css" href="/assets/code.css"/><link rel="stylesheet" type="text/css" href="/assets/style.css"/>
</head><body><header><div class="container"><h1>Gold Ayan's Tinker Garage</h1></div><div class="header-content"><nav class="container"><ul class="topnav"><li><a href="/index.html">Home</a></li><li><a href="/projects.html">Projects</a></li><li><a href="/posts">Posts</a></li><li><a href="/til.html">TIL</a></li><li><a href="/blogrolls.html">Blogrolls</a></li><li><a href="/feed.xml">RSS</a></li></ul></nav></div></header><article class="container"><div class="blog-content"><p>
My junior and I were debugging an issue on a web page where pressing
the enter key while entering text in an input field triggers a
button. Let's call that button 'Button B'.
</p>

<p>
We didn't know why this was happening. There are two buttons, A and B,
on that page, but only Button B's `onclick` is triggered.
</p>

<p>
Upon closer inspection:
</p>

<div id="outline-container-org442884e" class="outline-2">
<h2 id="org442884e">Button A code:</h2>
<div class="outline-text-2" id="text-org442884e">
<div class="org-src-container">
<pre class="src src-html">&lt;<span class="org-function-name">button</span> <span class="org-variable-name">type</span>=<span class="org-string">"button"</span> <span class="org-variable-name">name</span>=<span class="org-string">"sample"</span> <span class="org-variable-name">class</span>=<span class="org-string">"green-button"</span>&gt;Button A&lt;/<span class="org-function-name">button</span>&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-org0009b4b" class="outline-2">
<h2 id="org0009b4b">Button B code:</h2>
<div class="outline-text-2" id="text-org0009b4b">
<div class="org-src-container">
<pre class="src src-html">&lt;<span class="org-function-name">button</span> <span class="org-variable-name">name</span>=<span class="org-string">"sample2"</span> <span class="org-variable-name">class</span>=<span class="org-string">"green-button"</span>&gt;Button B&lt;/<span class="org-function-name">button</span>&gt;
</pre>
</div>

<p>
The `type` attribute is missing in Button B. After we added the
`type`, Button B was no longer triggered by the enter key.
</p>

<p>
Okay, cool! What is the default `type` attribute for a button?
</p>

<p>
When we explored the MDN docs, we found that the default button type
is `submit`, which caused this issue.
</p>
</div>
</div>

<div id="outline-container-org27018b5" class="outline-2">
<h2 id="org27018b5">Proof of Concept:</h2>
<div class="outline-text-2" id="text-org27018b5">
<ul class="org-ul">
<li>Keep the cursor in the input text field and press enter; the submit
button's `onclick` will be called.</li>
</ul>
<div class="org-src-container">
<pre class="src src-html">&lt;<span class="org-keyword">!DOCTYPE</span> html&gt;
&lt;<span class="org-function-name">html</span> <span class="org-variable-name">lang</span>=<span class="org-string">"en"</span>&gt;
&lt;<span class="org-function-name">head</span>&gt;
    &lt;<span class="org-function-name">meta</span> <span class="org-variable-name">charset</span>=<span class="org-string">"UTF-8"</span>&gt;
    &lt;<span class="org-function-name">meta</span> <span class="org-variable-name">name</span>=<span class="org-string">"viewport"</span> <span class="org-variable-name">content</span>=<span class="org-string">"width=device-width, initial-scale=1.0"</span>&gt;
    &lt;<span class="org-function-name">title</span>&gt;<span class="org-underline"><span class="org-bold">Form with Buttons</span></span>&lt;/<span class="org-function-name">title</span>&gt;
&lt;/<span class="org-function-name">head</span>&gt;
&lt;<span class="org-function-name">body</span>&gt;

&lt;<span class="org-function-name">h1</span>&gt;<span class="org-underline"><span class="org-bold">Sample Form</span></span>&lt;/<span class="org-function-name">h1</span>&gt;
&lt;<span class="org-function-name">form</span> <span class="org-variable-name">id</span>=<span class="org-string">"myForm"</span>&gt;
    &lt;<span class="org-function-name">label</span> <span class="org-variable-name">for</span>=<span class="org-string">"name"</span>&gt;Name:&lt;/<span class="org-function-name">label</span>&gt;
    &lt;<span class="org-function-name">input</span> <span class="org-variable-name">type</span>=<span class="org-string">"text"</span> <span class="org-variable-name">id</span>=<span class="org-string">"name"</span> <span class="org-variable-name">name</span>=<span class="org-string">"name"</span> required&gt;
    &lt;<span class="org-function-name">br</span>&gt;&lt;<span class="org-function-name">br</span>&gt;

    &lt;<span class="org-function-name">button</span> <span class="org-variable-name">type</span>=<span class="org-string">"button"</span> <span class="org-variable-name">onclick</span>=<span class="org-string">"alert('Button with type button clicked!')"</span>&gt;Button Type None&lt;/<span class="org-function-name">button</span>&gt;
    &lt;<span class="org-function-name">button</span> <span class="org-variable-name">type</span>=<span class="org-string">"submit"</span> <span class="org-variable-name">onclick</span>=<span class="org-string">"alert('Button with type submit clicked!')"</span>&gt;Submit&lt;/<span class="org-function-name">button</span>&gt;
&lt;/<span class="org-function-name">form</span>&gt;

&lt;/<span class="org-function-name">body</span>&gt;
&lt;/<span class="org-function-name">html</span>&gt;
</pre>
</div>


<p>
I tried similar thing using input tag for button and having input
type as submit which trigger the submit onclick on enter key press in
the text field
</p>

<div class="org-src-container">
<pre class="src src-html">&lt;<span class="org-function-name">input</span> <span class="org-variable-name">type</span>=<span class="org-string">"submit"</span> <span class="org-variable-name">value</span>=<span class="org-string">"Click me"</span> <span class="org-variable-name">onclick</span>=<span class="org-string">"alert('Button with type button clicked!')"</span>&gt;
</pre>
</div>

<p>
pretty interesting..
</p>
</div>
</div>
</div></article><footer>This site is made with ❤️ using Emacs.</footer></body></html>
